web/app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `password`, `email`) VALUES('2010-02-10 07:31:30', '04e69541f182b6b7f174fa0d75602ac33e1f40e086b6cbd8298981dacd20322adf87ce8a26d8da14ba3c09572d5ad9907743e73db20a99643d86a01ca68303fa', '2010-02-10 07:31:30', 'colinyoung', 'UUePqU4Wmu1NwYDNkVAh', '4b7877786828968f7fbe7a037e50e6fb7bd1dac37051ca1325c98bbcef43d2cf51b286530f0ef3523975207c6fd8cdbe839476c0fddc4d4f266b40181a635265', NULL, 'me@colinyoung.name')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save