api/app/controllers/api_users_controller.rb

INSERT INTO "api_users" ("created_at", "crypted_password", "updated_at", "level", "api_key", "password_salt", "last_name", "persistence_token", "first_name", "email", "active") VALUES('2010-02-18 02:07:34', '9142b90c8bbabc68396b960756628396ae5f1e6bda7499bdda9d41b705a8d9565f23d597712574b52b5334a4c790f7c8702a727094321f304d2facdc873dd1c0', '2010-02-18 02:07:34', NULL, NULL, 'ZfpgujylJ1jyfZI6QAel', 'Young', 'b9bc2b3a0f2ae97ba2f1e02945820faac08a432733e4343f01c17e8daad420f339c21adf0e82dac3cb5d396a9f3b0f1ef285fb2a2cd7a6527eaddad7e1849f21', 'Colin', 'cyoung23@mail.depaul.edu', NULL)
---
  def create
  @api_user = ApiUser.new(params[:api_user])
  @api_user.api_key = Digest::SHA1.hexdigest(@api_user.email)
    if @api_user.save

SELECT * FROM "api_users" WHERE ("api_users"."id" = '18') LIMIT 1
---
  def show
    @api_user = ApiUser.find(current_api_user)

SELECT * FROM "api_users" WHERE ("api_users"."id" = '18') LIMIT 1
---
  def edit
    @api_user = ApiUser.find(current_api_user)

SELECT * FROM "api_users" WHERE ("api_users"."id" = '18') LIMIT 1
UPDATE "api_users" SET "persistence_token" = '8e2890479db4998f79870ca135a36729c09ac3f9adc0d9a0df6d367da5fccd48f424848d37f8a399e16659bec84cf02df8fbad503724ebc89074d768be5e547d', "updated_at" = '2010-02-18 03:56:37', "password_salt" = 'ryVYcvBnGs3hP_Zm63IR', "crypted_password" = '4cfb31216da61af1c6c5103c6b17db8a46846779f9501e6e27d9a9ce812a5a28fb10c49672e8aae31dedc543bcaabbf4beca428aac59aac9eeb0ae31feca61f0' WHERE "id" = 18
---
  def update
    @api_user = ApiUser.find(current_api_user)
        @api_user.first_name = params[:api_user][:first_name]
        @api_user.last_name = params[:api_user][:last_name]
        @api_user.email = params[:api_user][:email]
        if !params[:api_user][:password].empty?
          @api_user.password = params[:api_user][:password]
          @api_user.password_confirmation = params[:api_user][:password]
        end
        if @api_user.save

SELECT * FROM "api_users" WHERE ("api_users"."id" = '18') LIMIT 1
UPDATE "api_users" SET "updated_at" = '2010-02-18 03:20:24', "api_key" = '243df0f4f4cc8e496bd2a87735079b5e1a158510' WHERE "id" = 18
---
  def regenerate_key
    @api_user = ApiUser.find(current_api_user)
    @api_user.api_key = Digest::SHA1.hexdigest(@api_user.email + Time.now.to_s)
    @api_user.save