api/app/controllers/courses_controller.rb

SELECT "students".id FROM "students" WHERE ("students"."col_username" = 'cyoung23' AND "students".id <> 1) LIMIT 1
---
  def index
    if !Student.exists?(:col_username => params[:col_username])

SELECT * FROM "courses" INNER JOIN "courses_students" ON "courses".id = "courses_students".course_id WHERE ("courses"."id" = 1 AND ("courses_students".student_id = 1 ))
SELECT * FROM "students" WHERE ("students"."id" = 1)
---
  def show
    @course = Student.find(params[:student][:col_username]).courses.find(params[:id])

SELECT * FROM "courses" WHERE ("courses"."id" = 1)
---
  def edit
    @course = Course.find(params[:id])