api/app/controllers/students_controller.rb

  def create
    @student = Student.new(params[:student])
    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("created_at", "encrypted_col_password", "col_username", "updated_at", "last_name", "first_name") VALUES('2010-02-18 05:55:15', NULL, NULL, '2010-02-18 05:55:15', NULL, NULL)